jmeter.log
2023-07-04 21:17:20,427 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2023-07-04 21:17:20,447 INFO o.a.j.JMeter: Loading user properties from: D:\apache-jmeter-5.5\bin\user.properties
2023-07-04 21:17:20,447 INFO o.a.j.JMeter: Loading system properties from: D:\apache-jmeter-5.5\bin\system.properties
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: Version 5.5
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: java.version=11.0.18
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: os.name=Windows 11
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: os.arch=amd64
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: os.version=10.0
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: file.encoding=Cp1252
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: java.awt.headless=true
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: Max memory     =1073741824
2023-07-04 21:17:20,455 INFO o.a.j.JMeter: Available Processors =4
2023-07-04 21:17:20,465 INFO o.a.j.JMeter: Default Locale=English (EN)
2023-07-04 21:17:20,465 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2023-07-04 21:17:20,465 INFO o.a.j.JMeter: JMeterHome=D:\apache-jmeter-5.5
2023-07-04 21:17:20,465 INFO o.a.j.JMeter: user.dir  =D:\apache-jmeter-5.5\bin\assignment
2023-07-04 21:17:20,465 INFO o.a.j.JMeter: PWD       =D:\apache-jmeter-5.5\bin\assignment
2023-07-04 21:17:20,466 INFO o.a.j.JMeter: IP: 192.168.0.106 Name: DESKTOP-Q126JEC FullName: DESKTOP-Q126JEC
2023-07-04 21:17:20,477 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'D:\apache-jmeter-5.5\bin\assignment\Reports'
2023-07-04 21:17:20,480 INFO o.a.j.s.FileServer: Default base='D:\apache-jmeter-5.5\bin\assignment'
2023-07-04 21:17:20,481 INFO o.a.j.s.FileServer: Set new base='D:\apache-jmeter-5.5\bin\assignment\.'
2023-07-04 21:17:20,637 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2023-07-04 21:17:20,669 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2023-07-04 21:17:20,673 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2023-07-04 21:17:20,675 INFO o.a.j.s.SaveService: Loading file: .\Tranjaction-API.jmx
2023-07-04 21:17:20,723 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-07-04 21:17:20,723 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-07-04 21:17:20,723 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-07-04 21:17:20,723 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-07-04 21:17:20,723 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2023-07-04 21:17:20,723 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2023-07-04 21:17:20,769 INFO o.a.j.JMeter: Creating summariser <summary>
2023-07-04 21:17:20,772 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2023-07-04 21:17:20,772 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: .\Tranjaction-API.csv
2023-07-04 21:17:20,773 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: D:\apache-jmeter-5.5\bin\reportgenerator.properties
2023-07-04 21:17:20,773 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2023-07-04 21:17:20,777 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2023-07-04 21:17:20,779 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2023-07-04 21:17:20,779 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2023-07-04 21:17:20,779 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2023-07-04 21:17:20,779 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2023-07-04 21:17:20,779 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2023-07-04 21:17:20,779 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2023-07-04 21:17:20,779 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2023-07-04 21:17:20,780 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2023-07-04 21:17:20,783 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,783 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,783 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,783 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,784 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,784 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,784 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,784 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,784 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,784 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2023-07-04 21:17:20,785 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2023-07-04 21:17:20,785 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2023-07-04 21:17:20,785 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2023-07-04 21:17:20,785 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2023-07-04 21:17:20,785 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2023-07-04 21:17:20,785 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2023-07-04 21:17:20,795 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2023-07-04 21:17:20,795 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-07-04 21:17:20,795 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-07-04 21:17:20,802 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2023-07-04 21:17:20,802 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2023-07-04 21:17:21,077 INFO o.a.j.JMeter: Running test (1688483841077)
2023-07-04 21:17:21,098 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2023-07-04 21:17:21,098 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2023-07-04 21:17:21,098 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-07-04 21:17:21,099 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2023-07-04 21:17:21,113 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-07-04 21:17:21,113 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2023-07-04 21:17:21,168 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2023-07-04 21:17:21,171 INFO o.a.j.s.FileServer: Stored: C:/Users/DELL/Downloads/apache-jmeter-5.5/apache-jmeter-5.5/bin/N B-7.csv
2023-07-04 21:17:21,171 ERROR o.a.j.t.JMeterThread: Test failed!
java.lang.IllegalArgumentException: Could not read file header line for file C:/Users/DELL/Downloads/apache-jmeter-5.5/apache-jmeter-5.5/bin/N B-7.csv
	at org.apache.jmeter.services.FileServer.reserveFile(FileServer.java:283) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.config.CSVDataSet.initVars(CSVDataSet.java:216) ~[ApacheJMeter_components.jar:5.5]
	at org.apache.jmeter.config.CSVDataSet.iterationStart(CSVDataSet.java:171) ~[ApacheJMeter_components.jar:5.5]
	at org.apache.jmeter.control.GenericController.fireIterationStart(GenericController.java:399) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.control.GenericController.fireIterEvents(GenericController.java:391) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.control.GenericController.next(GenericController.java:160) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.control.LoopController.next(LoopController.java:134) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.threads.AbstractThreadGroup.next(AbstractThreadGroup.java:99) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.threads.JMeterThread.run(JMeterThread.java:266) ~[ApacheJMeter_core.jar:5.5]
	at java.lang.Thread.run(Thread.java:834) ~[?:?]
Caused by: java.lang.IllegalArgumentException: File N B-7.csv must exist and be readable
	at org.apache.jmeter.services.FileServer.createBufferedReader(FileServer.java:424) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.services.FileServer.readLine(FileServer.java:340) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.services.FileServer.readLine(FileServer.java:324) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.services.FileServer.reserveFile(FileServer.java:272) ~[ApacheJMeter_core.jar:5.5]
	... 9 more
2023-07-04 21:17:21,182 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2023-07-04 21:17:21,183 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2023-07-04 21:17:21,184 INFO o.a.j.r.Summariser: summary =      0 in 00:00:00 = ******/s Avg:     0 Min: 9223372036854775807 Max: -9223372036854775808 Err:     0 (0.00%)
2023-07-04 21:17:21,185 INFO o.a.j.JMeter: Generating Dashboard
2023-07-04 21:17:21,185 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2023-07-04 21:17:21,200 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2023-07-04 21:17:21,338 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2023-07-04 21:17:21,338 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2023-07-04 21:17:21,339 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2023-07-04 21:17:21,339 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2023-07-04 21:17:21,339 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2023-07-04 21:17:21,339 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2023-07-04 21:17:21,339 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2023-07-04 21:17:21,339 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2023-07-04 21:17:21,346 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2023-07-04 21:17:21,347 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2023-07-04 21:17:21,347 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2023-07-04 21:17:21,348 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2023-07-04 21:17:21,349 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2023-07-04 21:17:21,349 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 0 samples
2023-07-04 21:17:21,349 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 0 samples
2023-07-04 21:17:21,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 0 samples
2023-07-04 21:17:21,351 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 0 samples produced in 118ms on channel 0
2023-07-04 21:17:21,351 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2023-07-04 21:17:21,465 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2023-07-04 21:17:21,465 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2023-07-04 21:17:21,465 ERROR o.a.j.JMeter: Error generating the report: null
java.lang.NullPointerException: null
	at org.apache.jmeter.report.dashboard.JsonExporter.createStatistic(JsonExporter.java:121) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.dashboard.JsonExporter.export(JsonExporter.java:72) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.dashboard.ReportGenerator.exportData(ReportGenerator.java:382) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.dashboard.ReportGenerator.generate(ReportGenerator.java:260) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter$ListenToTest.endTest(JMeter.java:1264) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter$ListenToTest.testEnded(JMeter.java:1219) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.engine.StandardJMeterEngine.notifyTestListenersOfEnd(StandardJMeterEngine.java:230) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.engine.StandardJMeterEngine.run(StandardJMeterEngine.java:507) ~[ApacheJMeter_core.jar:5.5]
	at java.lang.Thread.run(Thread.java:834) ~[?:?]